# Qusetion 1

In [16]:
import pandas as pd
pd.__version__

'0.23.0'

# Question 2

In [62]:
yet = pd.read_csv("Csv1.csv")
yet.head(3)

,Address.City,ID,LocationMilestones.LastRemodelDate,LocationMilestones.OpenDate,Name,Store.StoreDistrictID,TimeZone.TimeZoneCode,PhoneNumber
0,Oxford,2153,NaN,2006-07-19T12:00:00,Oxford,340,CST,(256) 231-2900
1,Opelika,1499,NaN,2005-07-20T12:00:00,Opelika,340,CST,(334) 705-0152
2,Carrollton,1073,NaN,1997-07-23T12:00:00,Carrollton,336,EST,(770) 838-9221

In [18]:
again = pd.read_csv("Csv2.csv")
again.head(3)

,Address.City,ID,Name,FaxNumber,BeginTime.MF,ThruTime.MF,IsOpen.Sat,IsOpen.Sun
0,Oxford,2153,Oxford,(256) 231-2910,08:00:00,22:00:00,True,False
1,Opelika,1499,Opelika,(334) 363-3235,08:00:00,22:00:00,False,True
2,Carrollton,1073,Carrollton,(678) 664-3234,08:00:00,22:00:00,True,True

# Question 3

In [19]:
result = yet.merge(again, on = "ID", how = "inner", suffixes = [ "-1st", "-2nd"])
result.head(3)

,Address.City-1st,ID,LocationMilestones.LastRemodelDate,LocationMilestones.OpenDate,Name-1st,Store.StoreDistrictID,TimeZone.TimeZoneCode,PhoneNumber,Address.City-2nd,Name-2nd,FaxNumber,BeginTime.MF,ThruTime.MF,IsOpen.Sat,IsOpen.Sun
0,Oxford,2153,NaN,2006-07-19T12:00:00,Oxford,340,CST,(256) 231-2900,Oxford,Oxford,(256) 231-2910,08:00:00,22:00:00,True,False
1,Opelika,1499,NaN,2005-07-20T12:00:00,Opelika,340,CST,(334) 705-0152,Opelika,Opelika,(334) 363-3235,08:00:00,22:00:00,False,True
2,Carrollton,1073,NaN,1997-07-23T12:00:00,Carrollton,336,EST,(770) 838-9221,Carrollton,Carrollton,(678) 664-3234,08:00:00,22:00:00,True,True

# Question 4

In [20]:
result.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 108 entries, 0 to 107
Data columns (total 15 columns):
Address.City-1st                      108 non-null object
ID                                    108 non-null int64
LocationMilestones.LastRemodelDate    73 non-null object
LocationMilestones.OpenDate           108 non-null object
Name-1st                              108 non-null object
Store.StoreDistrictID                 108 non-null int64
TimeZone.TimeZoneCode                 108 non-null object
PhoneNumber                           108 non-null object
Address.City-2nd                      108 non-null object
Name-2nd                              108 non-null object
FaxNumber                             103 non-null object
BeginTime.MF                          108 non-null object
ThruTime.MF                           108 non-null object
IsOpen.Sat                            108 non-null bool
IsOpen.Sun                            108 non-null bool
dtypes: bool(2), int64(2), object(11)
memory usage: 12.0+ KB

In [30]:
result.columns

Index(['Address.City_x', 'ID', 'LocationMilestones.LastRemodelDate',
       'LocationMilestones.OpenDate', 'Name_x', 'Store.StoreDistrictID',
       'TimeZone.TimeZoneCode', 'PhoneNumber', 'Address.City_y', 'Name_y',
       'FaxNumber', 'BeginTime.MF', 'ThruTime.MF', 'IsOpen.Sat', 'IsOpen.Sun'],
      dtype='object')

In [75]:
result.shape

(108, 15)

In [132]:
X=result.as_matrix(columns=[result[1:]])
result.columns[1:]
result.as_matrix(columns=result.columns)

C:\Users\Maxwell\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Method .as_matrix will be removed in a future version. Use .values instead.
  """Entry point for launching an IPython kernel.
C:\Users\Maxwell\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: Method .as_matrix will be removed in a future version. Use .values instead.
  This is separate from the ipykernel package so we can avoid doing imports until

array([['Oxford', 2153, nan, ..., '22:00:00', True, False],
       ['Opelika', 1499, nan, ..., '22:00:00', False, True],
       ['Carrollton', 1073, nan, ..., '22:00:00', True, True],
       ...,
       ['Arden', 2011, '2012-06-21T12:00:00', ..., '22:00:00', True,
        False],
       ['Spartanburg', 1349, '2012-06-21T12:00:00', ..., '22:00:00',
        True, True],
       ['Asheville', 1807, '2012-03-22T12:00:00', ..., '23:00:00', True,
        True]], dtype=object)

In [15]:
type(result)

pandas.core.frame.DataFrame

# Question 5

In [154]:
first_data = yet.rename(columns = {"Name":"Store Name"}, inplace = True)
yet.head(3)

,Address.City,ID,LocationMilestones.LastRemodelDate,LocationMilestones.OpenDate,Store Name,Store.StoreDistrictID,TimeZone.TimeZoneCode,PhoneNumber
0,Oxford,2153,NaN,2006-07-19T12:00:00,Oxford,340,CST,(256) 231-2900
1,Opelika,1499,NaN,2005-07-20T12:00:00,Opelika,340,CST,(334) 705-0152
2,Carrollton,1073,NaN,1997-07-23T12:00:00,Carrollton,336,EST,(770) 838-9221

In [155]:
second_data = again.rename(columns = {"Name":"Store Name"}, inplace = True)
again.head(3)

,Address.City,ID,Store Name,FaxNumber,BeginTime.MF,ThruTime.MF,IsOpen.Sat,IsOpen.Sun
0,Oxford,2153,Oxford,(256) 231-2910,08:00:00,22:00:00,True,False
1,Opelika,1499,Opelika,(334) 363-3235,08:00:00,22:00:00,False,True
2,Carrollton,1073,Carrollton,(678) 664-3234,08:00:00,22:00:00,True,True

# Question 6

In [157]:
#this generally checks for null values across all rows and columns
#if i had extracted a paticular row then i will have a dataframe 
null = yet.isnull()
null.head(3)

,Address.City,ID,LocationMilestones.LastRemodelDate,LocationMilestones.OpenDate,Store Name,Store.StoreDistrictID,TimeZone.TimeZoneCode,PhoneNumber
0,False,False,True,False,False,False,False,False
1,False,False,True,False,False,False,False,False
2,False,False,True,False,False,False,False,False

In [158]:
null = again.isnull()
null.tail(3)
# again[null]

,Address.City,ID,Store Name,FaxNumber,BeginTime.MF,ThruTime.MF,IsOpen.Sat,IsOpen.Sun
112,False,False,False,False,False,False,False,False
113,False,False,False,False,False,False,False,False
114,False,False,False,False,False,False,False,False

In [72]:
address = again[[ "ID" ]].isnull()
address.head(3)
address.count()

ID    115
dtype: int64

In [195]:
null = result.isnull()
null.head(3)

,Address.City-1st,ID,LocationMilestones.LastRemodelDate,LocationMilestones.OpenDate,Store Name-1st,Store.StoreDistrictID,TimeZone.TimeZoneCode,PhoneNumber,Address.City-2nd,Store Name-2nd,FaxNumber,BeginTime.MF,ThruTime.MF,IsOpen.Sat,IsOpen.Sun
0,False,False,True,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,True,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,True,False,False,False,False,False,False,False,False,False,False,False,False

In [50]:
null.count()

Address.City_x                        108
ID                                    108
LocationMilestones.LastRemodelDate    108
LocationMilestones.OpenDate           108
Name_x                                108
Store.StoreDistrictID                 108
TimeZone.TimeZoneCode                 108
PhoneNumber                           108
Address.City_y                        108
Name_y                                108
FaxNumber                             108
BeginTime.MF                          108
ThruTime.MF                           108
IsOpen.Sat                            108
IsOpen.Sun                            108
dtype: int64

# Question 7

In [190]:
#Using this data because it is the one that contains the needed datas
again = pd.read_csv("Csv2.csv")
second_data = again.rename(columns = {"Name":"Store Name"}, inplace = True)
again.head(3)

,Address.City,ID,Store Name,FaxNumber,BeginTime.MF,ThruTime.MF,IsOpen.Sat,IsOpen.Sun
0,Oxford,2153,Oxford,(256) 231-2910,08:00:00,22:00:00,True,False
1,Opelika,1499,Opelika,(334) 363-3235,08:00:00,22:00:00,False,True
2,Carrollton,1073,Carrollton,(678) 664-3234,08:00:00,22:00:00,True,True

In [161]:
response = again[["IsOpen.Sat", "IsOpen.Sun"]]
response.head(3)

   IsOpen.Sat  IsOpen.Sun
0        True       False
1       False        True
2        True        True

In [162]:
#focus point "IsOpen.Sat" which returns true
# booleantrue = response[response["IsOpen.Sat"]]
# booleantrue.head(5)
response["IsOpen.Sat"].value_counts()

True     107
False      8
Name: IsOpen.Sat, dtype: int64

In [166]:
#this alraedy retuens true
# booleantrue = response[response["IsOpen.Sat"]].count()
# booleantrue
#this alraedy retuens true
# booleansun = response[response["IsOpen.Sun"]].count
# booleansun

In [164]:
#this already returns true, focus point sun
response["IsOpen.Sun"].value_counts()

True     90
False    25
Name: IsOpen.Sun, dtype: int64

In [104]:
from collections import Counter
from bokeh.palettes import Category20c
from ipykernel import kernelapp as app
from bokeh.plotting import figure, output_file, show
from bokeh.models import Range1d, PanTool, ResetTool, HoverTool

x = Counter({'Saturday True': 90, 'Saturday False': 25, 'Sunday True': 107, 'Sunday False': 8 })

x = pd.DataFrame.from_dict(dict(x), orient='index').reset_index().rename(index=str, \
                                                                         columns={0:'value', 'index':'weekend_stats'})
x['val'] = x['value']
x['value'] = x['value']/x['value'].sum()*360.0
x['end']=x['value'].expanding(1).sum()
x['start'] = x['end'].shift(1)
x['start'][0]=0
r=[]
p = figure(plot_height=350, title="Weekend Graphical Statistics", toolbar_location=None, tools="")
for i in range(len(x)):
    r1 = p.wedge(x=0, y=1, radius=0.5,start_angle=x.iloc[i]['start'], end_angle=x.iloc[i]['end'],\
               start_angle_units='deg', end_angle_units = 'deg', fill_color=Category20c[20][i],\
                legend = x.iloc[i]['weekend_stats'])
    Weekend_Stats = x.iloc[i]['weekend_stats']
    Value = x.iloc[i]['val']
    hover = HoverTool(tooltips=[
        ("Weekend_Stats", "%s" %Weekend_Stats),
        ("Value", "%s" %Value)
    ], renderers=[r1])
    p.add_tools(hover)

#Style axis
p.xaxis.axis_label = "X-axis"
p.yaxis.axis_label = "Y-axis"

#Style the plot area
p.plot_width=900
p.plot_height=580
p.background_fill_color="#FFA500"
p.background_fill_alpha=0.5

#Style the tools

p.toolbar_location = 'right'
# p.toolbar.logo = None
    

output_file("update.html")
show(p)

C:\Users\Maxwell\Anaconda3\lib\site-packages\ipykernel_launcher.py:14: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

# Question 8

In [5]:
import datetime as dt
again = pd.read_csv("Csv2.csv")
second_data = again.rename(columns = {"Name":"Store Name"}, inplace = True)
again.head(3)

,Address.City,ID,Store Name,FaxNumber,BeginTime.MF,ThruTime.MF,IsOpen.Sat,IsOpen.Sun
0,Oxford,2153,Oxford,(256) 231-2910,08:00:00,22:00:00,True,False
1,Opelika,1499,Opelika,(334) 363-3235,08:00:00,22:00:00,False,True
2,Carrollton,1073,Carrollton,(678) 664-3234,08:00:00,22:00:00,True,True

In [37]:
import pandas as pd
import datetime as dt
again = pd.read_csv("Csv2.csv")
second_data = again.rename(columns = {"Name":"Store Name"}, inplace = True)
mask = again["ThruTime.MF"] == "11:00:00"
again[mask]

Empty DataFrame
Columns: [Address.City, ID, Store Name, FaxNumber, BeginTime.MF, ThruTime.MF, IsOpen.Sat, IsOpen.Sun]
Index: []

In [4]:
yet = pd.read_csv("Csv1.csv")
again = pd.read_csv("Csv2.csv")
result = yet.merge(again, on = "ID", how = "inner", suffixes = [ "-1st", "-2nd"])
result.head(3)

,Address.City-1st,ID,LocationMilestones.LastRemodelDate,LocationMilestones.OpenDate,Name-1st,Store.StoreDistrictID,TimeZone.TimeZoneCode,PhoneNumber,Address.City-2nd,Name-2nd,FaxNumber,BeginTime.MF,ThruTime.MF,IsOpen.Sat,IsOpen.Sun
0,Oxford,2153,NaN,2006-07-19T12:00:00,Oxford,340,CST,(256) 231-2900,Oxford,Oxford,(256) 231-2910,08:00:00,22:00:00,True,False
1,Opelika,1499,NaN,2005-07-20T12:00:00,Opelika,340,CST,(334) 705-0152,Opelika,Opelika,(334) 363-3235,08:00:00,22:00:00,False,True
2,Carrollton,1073,NaN,1997-07-23T12:00:00,Carrollton,336,EST,(770) 838-9221,Carrollton,Carrollton,(678) 664-3234,08:00:00,22:00:00,True,True

# Question 9

In [135]:
again = pd.read_csv("Csv1.csv")
second_data = again.rename(columns = {"LocationMilestones.LastRemodelDate":"LastRemodelDate"}, inplace = True)
sub = again.dropna(subset = ["LastRemodelDate"])
last = sub.LastRemodelDate.to_dict()
print(last)
# i use print to save more spaces instead of having a long list since dict does not allow the use of heads()

{3: '2013-06-27T12:00:00', 4: '2004-10-17T12:00:00', 5: '2013-10-10T12:00:00', 6: '2014-04-03T12:00:00', 10: '2007-10-18T12:00:00', 14: '2012-06-21T12:00:00', 16: '2004-08-08T12:00:00', 18: '2013-06-27T12:00:00', 22: '2012-03-22T12:00:00', 23: '2012-03-22T12:00:00', 24: '2012-03-22T12:00:00', 26: '2012-06-21T12:00:00', 27: '2012-06-21T12:00:00', 28: '2017-03-30T12:00:00', 29: '2012-06-21T12:00:00', 30: '2013-03-21T12:00:00', 31: '2013-10-10T12:00:00', 32: '2012-03-22T12:00:00', 34: '2004-09-19T12:00:00', 36: '2012-03-22T12:00:00', 37: '2000-03-01T12:00:00', 38: '2017-10-26T12:00:00', 39: '2012-06-21T12:00:00', 40: '2012-10-11T12:00:00', 42: '2013-06-27T12:00:00', 44: '2012-06-21T12:00:00', 46: '2017-03-30T12:00:00', 48: '2012-03-22T12:00:00', 49: '2017-10-26T12:00:00', 50: '2007-04-13T12:00:00', 55: '2017-03-30T12:00:00', 56: '2012-10-11T12:00:00', 58: '2012-03-22T12:00:00', 60: '2012-06-21T12:00:00', 61: '2012-03-22T12:00:00', 62: '2012-03-22T12:00:00', 64: '2007-07-13T12:00:00', 65: '2012-03-22T12:00:00', 66: '2009-07-09T12:00:00', 67: '2012-03-22T12:00:00', 68: '2012-03-22T12:00:00', 69: '2012-10-11T12:00:00', 71: '2013-06-27T12:00:00', 73: '2012-03-22T12:00:00', 74: '2012-03-22T12:00:00', 75: '2004-08-08T12:00:00', 76: '2012-03-22T12:00:00', 77: '2014-10-12T12:00:00', 78: '2012-10-11T12:00:00', 79: '2012-10-11T12:00:00', 81: '2012-06-21T12:00:00', 82: '2012-06-21T12:00:00', 85: '2012-06-21T12:00:00', 86: '2014-04-03T12:00:00', 87: '2012-06-21T12:00:00', 88: '2012-06-21T12:00:00', 90: '2017-04-13T12:00:00', 91: '2012-10-11T12:00:00', 92: '2010-10-14T12:00:00', 93: '2012-03-22T12:00:00', 94: '2012-06-21T12:00:00', 95: '2012-03-22T12:00:00', 96: '2018-04-13T12:00:00', 97: '2014-04-03T12:00:00', 98: '2006-05-12T12:00:00', 99: '2003-08-12T12:00:00', 100: '2012-03-22T12:00:00', 101: '2007-03-23T12:00:00', 102: '2012-10-11T12:00:00', 104: '2012-06-21T12:00:00', 105: '2012-06-21T12:00:00', 106: '2012-06-21T12:00:00', 107: '2012-03-22T12:00:00', 108: '2011-06-02T12:00:00', 109: '2011-10-06T12:00:00', 111: '2011-10-06T12:00:00', 113: '2014-10-12T12:00:00', 115: '2012-06-21T12:00:00', 116: '2018-04-13T12:00:00', 117: '2011-07-21T12:00:00', 118: '2012-03-22T12:00:00'}

In [103]:
# mask = result["LocationMilestones.LastRemodelDate"].notnull()
# result[mask].head(5)

again = pd.read_csv("Csv1.csv")
second_data = again.rename(columns = {"Name":"Store Name"}, inplace = True)
sub = again.dropna(subset = ["Store Name"])
last = sub["Store Name"].to_dict()
print(last)

{0: 'Oxford', 1: 'Opelika', 2: 'Carrollton', 3: 'Newnan', 4: 'Columbus', 5: 'Peachtree City', 6: 'Montgomery', 7: 'Douglasville', 8: 'Prattville', 9: 'Birmingham 280 Corridor', 10: 'Fayetteville', 11: 'Trussville', 12: 'Hiram', 13: 'Alabaster', 14: 'East Point', 15: 'Homewood', 16: 'Austell', 17: 'Hoover West', 18: 'West Marietta', 19: 'Fultondale', 20: 'Acworth', 21: 'McDonough', 22: 'Atlanta Midtown', 23: 'Smyrna', 24: 'Atlanta Edgewood', 25: 'Bessemer', 26: 'Cobb', 27: 'Buckhead South', 28: 'Cartersville', 29: 'Buckhead', 30: 'North Druid Hills', 31: 'Sandy Springs Prado', 32: 'Marietta East', 33: 'Woodstock', 34: 'Cobb NE', 35: 'Atlanta Perimeter', 36: 'Northlake', 37: 'Roswell', 38: 'Peachtree Corners', 39: 'Conyers', 40: 'Alpharetta', 41: 'Canton', 42: 'Riverwood', 43: 'Milton', 44: 'Snellville', 45: "John's Creek", 46: 'Lawrenceville', 47: 'Cumming', 48: 'Buford', 49: 'Tuscaloosa', 50: 'Warner Robins', 51: 'Winder', 52: 'Flowery Branch', 53: 'Huntsville South', 54: 'Decatur', 55: 'Gainesville', 56: 'Dothan', 57: 'Huntsville West', 58: 'Albany', 59: 'Madison', 60: 'Chattanooga East', 61: 'Athens', 62: 'Chattanooga North', 63: 'Cleveland', 64: 'Florence', 65: 'Anderson', 66: 'Tallahassee North', 67: 'Murfreesboro', 68: 'Destin', 69: 'Pace', 70: 'Spring Hill', 71: 'Mary Esther', 72: 'Evans', 73: 'Pier Park', 74: 'Tallahassee', 75: 'Maryville', 76: 'Panama City', 77: 'Augusta', 78: 'Pensacola NE', 79: 'Franklin', 80: 'Smyrna', 81: 'Valdosta', 82: 'Pensacola', 83: 'Knoxville South', 84: 'Farragut', 85: 'Cool Springs', 86: 'Knoxville West', 87: 'Brentwood', 88: 'Mt Juliet', 89: 'Pensacola West', 90: 'Knoxville NW', 91: 'Simpsonville', 92: 'Nashville East', 93: 'White Bridge', 94: 'Greenville', 95: 'Nashville West', 96: 'Daphne', 97: 'Knoxville North', 98: 'Aiken', 99: 'Bel-Air', 100: 'Greer', 101: 'Rivergate', 102: 'Hendersonville', 103: 'Mobile West', 104: 'Gulf Shores', 105: 'Asheville South', 106: 'Spartanburg', 107: 'Asheville', 108: 'Palm Desert', 109: 'Palm Springs', 110: 'Apple Valley North', 111: 'Apple Valley', 112: 'Hesperia', 113: 'Grand Junction', 114: 'Montrose', 115: 'Orem State Street', 116: 'American Fork', 117: 'Rancho California', 118: 'Murrieta'}

# Question 10

In [32]:
again = pd.read_csv("Csv2.csv")
second_data = again.rename(columns = {"Name":"Store Name"}, inplace = True)
again.groupby("Address.City")
again.head(3)

,Address.City,ID,Store Name,FaxNumber,BeginTime.MF,ThruTime.MF,IsOpen.Sat,IsOpen.Sun
0,Oxford,2153,Oxford,(256) 231-2910,08:00:00,22:00:00,True,False
1,Opelika,1499,Opelika,(334) 363-3235,08:00:00,22:00:00,False,True
2,Carrollton,1073,Carrollton,(678) 664-3234,08:00:00,22:00:00,True,True

In [36]:
add = again["Address.City"].value_counts()
add.head(5)

Atlanta       6
Knoxville     5
Birmingham    3
Nashville     3
Marietta      3
Name: Address.City, dtype: int64

# Question 11

In [120]:
import datetime as dt
date_serial = pd.date_range(start = "2000-03-10", end ="2018-12-28", freq = "Y")
serial_conv = pd.Series(date_serial)
serial_conv.head(4)

0   2000-12-31
1   2001-12-31
2   2002-12-31
3   2003-12-31
dtype: datetime64[ns]